{"data":{"site":{"siteMetadata":{"title":"Helixbassment","author":"Julian Rosse"}},"markdownRemark":{"id":"fc7b0c08-2bef-5eb9-aff0-7f3725fa35a4","excerpt":"I’m a big fan of using the Slack Github integration to get Github notifications for projects I’m involved withTypically in the past, each project has set up its…","html":"<p>I’m a big fan of using the <a href=\"https://slack.github.com/\">Slack Github integration</a> to get Github notifications for projects I’m involved with</p>\n<p>Typically in the past, each project has set up its own project-specific “activity channel” in Slack eg <code class=\"language-text\">#project-abc-activity</code> and then someone sets up all the automated integrations for the project there (Github, Zeplin, …)</p>\n<p>This works ok, but there have been differing opinions about eg the desired level of verbosity/frequency of notifications on that channel</p>\n<h3>Personalize it</h3>\n<p>Since there’s typically no human interaction on these activity channels (they’re “read-only”), why not just have your own personal version of that activity channel where you can tweak the configuration to your heart’s content?</p>\n<p>That’s the pattern I’ve landed on: a <code class=\"language-text\">#julian-activity</code> channel where I configure notifications for projects I’m currently involved in</p>\n<p>Then as I move between projects, that <code class=\"language-text\">#julian-activity</code> channel remains the single home for such notifications - I just add/remove integrations to that channel. No creating new channels every time a new project starts (and then eventually gathering dust once a project is completed since noone usually makes the call to go ahead and delete the shared channel)</p>\n<h3>Github integration tips</h3>\n<p>Once the Slack Github integration is installed, turning on and configuring notifications for a new project is super easy. To start notifications for a new Github repo just type in your Slack activity channel:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">/github subscribe repo-owner/repo-name</code></pre></div>\n<p>This will turn on notifications for issues, pull requests, statuses, commits, deployments, and public by default (per the <a href=\"https://get.slack.help/hc/en-us/articles/232289568-GitHub-for-Slack\">docs</a>)</p>\n<p>I like to tweak this a little bit and also get notifications for reviews, comments, and branches. So I’d typically then type a second command:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">/github subscribe repo-owner/repo-name reviews comments branches</code></pre></div>\n<p>(You can probably do that all as a single initial command, but this gets the job done)</p>\n<p>Then once I’m no longer involved in a project, I’ll go to my activity channel and type:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">/github unsubscribe repo-owner/repo-name</code></pre></div>\n<p>Boom! unsubscribed</p>","frontmatter":{"title":"Slack tip: personal activity channel","date":"May 12, 2019","description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/slack-personal-activity-channel/","previous":{"fields":{"slug":"/jiggle-webpack/"},"frontmatter":{"title":"Tip: “Jiggle” Webpack when it can’t resolve a new import"}},"next":null}}